![title](./pic/data_types_missing_values/data_types/1_title.png)

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('./csv/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

<br>

In diesem Notebook lernst du, wie du Datentypen innerhalb eines `DataFrames` oder einer `Series` untersuchen kannst. Außerdem lernst du, wie du Einträge suchen und ersetzen kannst.

---

## Dtypes

Der Datentyp für eine Spalte in einem DataFrame oder einer Serie wird als `dtype` bezeichnet.

Du kannst die Eigenschaft `dtype` verwenden, um den Typ einer bestimmten Spalte zu ermitteln. Zum Beispiel können wir den `dtype` der PassengerId im DataFrame "Titanic" abrufen:

In [4]:
df.PassengerId.dtype

dtype('int64')

Alternativ dazu gibt die Eigenschaft `dtypes` den `dtype` jeder Spalte im DataFrame zurück:

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Datentypen sagen etwas darüber aus, wie Pandas die Daten intern speichert. **float64** bedeutet, dass eine 64-Bit-Fließkommazahl verwendet wird; **int64** bedeutet stattdessen eine Ganzzahl ähnlicher Größe usw.

Eine Besonderheit, die man im Auge behalten sollte (und die hier sehr deutlich zu sehen ist), ist, dass Spalten, die ausschließlich aus Strings bestehen, keinen eigenen Typ erhalten; stattdessen wird ihnen der Objekttyp zugewiesen.

Ein DataFrame- oder Series-Index hat auch seinen eigenen `dtype`:

In [6]:
df.index.dtype

dtype('int64')

> Pandas unterstützt auch exotischere Datentypen, wie kategorische Daten und Zeitreihen-Daten. Da diese Datentypen seltener verwendet werden, werden wir sie bis zu einem späteren Abschnitt auslassen.

In [7]:
type(df.loc[0, 'PassengerId'])

numpy.int64